[Killed] LogicalNot
Controllers/AuthController.php:28:9
         $error = '';
 
         //append @gmail.com if missing but dont if its already there
-        if (!str_ends_with($email, '@gmail.com')) {
+        if (str_ends_with($email, '@gmail.com')) {
             $email .= '@gmail.com';
         }
killedBy: AuthControllerTest::testLoginInvalidPasswordFormat
statusReason: 1) AuthControllerTest::testLoginInvalidPasswordFormat
Failed asserting that 'Email must contain only letters and numbers before @gmail.com.' contains "Password must be 8 to 20 characters".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:28

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Assignment
Controllers/AuthController.php:29:13
 
         //append @gmail.com if missing but dont if its already there
         if (!str_ends_with($email, '@gmail.com')) {
-            $email .= '@gmail.com';
+            $email = '@gmail.com';
         }
 
killedBy: AuthControllerTest::testLoginInvalidPasswordFormat
statusReason: 1) AuthControllerTest::testLoginInvalidPasswordFormat
Failed asserting that 'Email must contain only letters and numbers before @gmail.com.' contains "Password must be 8 to 20 characters".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:28

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PregMatchRemoveCaret
Controllers/AuthController.php:33:9
         }
 
         //validate the email format
-        if (!preg_match('/^[A-Za-z0-9]+@gmail\.com$/', $email)) {
+        if (!preg_match('/[A-Za-z0-9]+@gmail\.com$/', $email)) {
             $error = 'Email must contain only letters and numbers before @gmail.com.';
         } elseif (strlen($email) < 1 || strlen($email) > 30) {
killedBy: AuthControllerTest::testLoginInvalidEmailFormat
statusReason: 1) AuthControllerTest::testLoginInvalidEmailFormat
Failed asserting that 'Invalid email or password.' contains "Email must contain only letters and numbers".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:21

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Controllers/AuthController.php:33:9
         }
 
         //validate the email format
-        if (!preg_match('/^[A-Za-z0-9]+@gmail\.com$/', $email)) {
+        if (preg_match('/^[A-Za-z0-9]+@gmail\.com$/', $email)) {
             $error = 'Email must contain only letters and numbers before @gmail.com.';
         } elseif (strlen($email) < 1 || strlen($email) > 30) {
killedBy: AuthControllerTest::testLoginInvalidEmailFormat
statusReason: 1) AuthControllerTest::testLoginInvalidEmailFormat
Failed asserting that 'Invalid email or password.' contains "Email must contain only letters and numbers".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:21

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] GreaterThanNegotiation
Controllers/AuthController.php:35:9
         //validate the email format
         if (!preg_match('/^[A-Za-z0-9]+@gmail\.com$/', $email)) {
             $error = 'Email must contain only letters and numbers before @gmail.com.';
-        } elseif (strlen($email) < 1 || strlen($email) > 30) {
+        } elseif (strlen($email) < 1 || strlen($email) <= 30) {
             $error = 'Email must be between 1 and 30 characters (including @gmail.com).';
         }
killedBy: AuthControllerTest::testLoginInvalidPasswordFormat
statusReason: 1) AuthControllerTest::testLoginInvalidPasswordFormat
Failed asserting that 'Email must be between 1 and 30 characters (including @gmail.com).' contains "Password must be 8 to 20 characters".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:28

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] LessThanNegotiation
Controllers/AuthController.php:35:9
         //validate the email format
         if (!preg_match('/^[A-Za-z0-9]+@gmail\.com$/', $email)) {
             $error = 'Email must contain only letters and numbers before @gmail.com.';
-        } elseif (strlen($email) < 1 || strlen($email) > 30) {
+        } elseif (strlen($email) >= 1 || strlen($email) > 30) {
             $error = 'Email must be between 1 and 30 characters (including @gmail.com).';
         }
killedBy: AuthControllerTest::testLoginInvalidPasswordFormat
statusReason: 1) AuthControllerTest::testLoginInvalidPasswordFormat
Failed asserting that 'Email must be between 1 and 30 characters (including @gmail.com).' contains "Password must be 8 to 20 characters".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:28

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] LogicalNot
Controllers/AuthController.php:40:9
         }
 
         //validate the password format
-        elseif (!preg_match('/^[A-Za-z0-9]{8,20}$/', $password)) {
+        } elseif (preg_match('/^[A-Za-z0-9]{8,20}$/', $password)) {
             $error = 'Password must be 8 to 20 characters long and only contain letters or numbers.';
         }
killedBy: AuthControllerTest::testLoginInvalidPasswordFormat
statusReason: 1) AuthControllerTest::testLoginInvalidPasswordFormat
Failed asserting that 'Invalid email or password.' contains "Password must be 8 to 20 characters".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:28

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Survived] PregMatchRemoveCaret
Controllers/AuthController.php:40:9
         }
 
         //validate the password format
-        elseif (!preg_match('/^[A-Za-z0-9]{8,20}$/', $password)) {
+        } elseif (!preg_match('/[A-Za-z0-9]{8,20}$/', $password)) {
             $error = 'Password must be 8 to 20 characters long and only contain letters or numbers.';
         }

[Killed] PublicVisibility
Controllers/AuthController.php:47:5
     }
 
     //process the login and return an error string on failure or a null on success (since it redirects on success)
-    public function login($email, $password) {
+    protected function login($email, $password)
         //use the controller validation method above
         [$email, $error] = $this->validateCredentials($email, $password);
killedBy: AuthControllerTest::testLoginInvalidEmailFormat
statusReason: 1) AuthControllerTest::testLoginInvalidEmailFormat
Error: Call to protected method App\Controllers\AuthController::login() from scope AuthControllerTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:20

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ReturnRemoval
Controllers/AuthController.php:50:9
     public function login($email, $password) {
         //use the controller validation method above
         [$email, $error] = $this->validateCredentials($email, $password);
-        if ($error) return $error; //should be set already in validateCredentials
+        
 
         //create a user model and save the user data to the session if the login is successful
killedBy: AuthControllerTest::testLoginInvalidEmailFormat
statusReason: 1) AuthControllerTest::testLoginInvalidEmailFormat
Failed asserting that 'Invalid email or password.' contains "Email must contain only letters and numbers".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:21

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IfNegation
Controllers/AuthController.php:50:9
     public function login($email, $password) {
         //use the controller validation method above
         [$email, $error] = $this->validateCredentials($email, $password);
-        if ($error) return $error; //should be set already in validateCredentials
+        if (!$error) {
 
         //create a user model and save the user data to the session if the login is successful
killedBy: AuthControllerTest::testLoginInvalidEmailFormat
statusReason: 1) AuthControllerTest::testLoginInvalidEmailFormat
Failed asserting that 'Invalid email or password.' contains "Email must contain only letters and numbers".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:21

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IfNegation
Controllers/AuthController.php:54:9
 
         //create a user model and save the user data to the session if the login is successful
         $user = new User($email, $password);
-        if ($user->login()) {
-            if (session_status() !== PHP_SESSION_ACTIVE) session_start();
-            $_SESSION['user'] = [
-                'accID' => $user->getId(),
-                'accEmail' => $user->getEmail(),
-                'accAdmin' => (int)$user->isAdmin(),
-                'bookings' => $user->getBookings(),
-            ];
-
-            //redirect to appropriate page based on admin or not (MVC now as of 13-11-2025)
-            //SUPER IMPRTANT MAKE NEWTICKETMASTERREPOSITORY MATCH YOUR REPO FOLDER NAME
-            //------------------------------------------------------------
-            $eventController = new EventController();
-            $eventController->showEventsPage($user->isAdmin());
-            exit;
-            //------------------------------------------------------------
-            //old redirect method below before MVC was added
-            //return null to show it worked (login returns string if failure, nothing (here) if it works)
-            //return null;
-        }
+        if (!$user->login()) {
 
         //only reached if login failed
statusReason: PHPUnit 10.0.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.12
Configuration: C:/Users/Veronica/AppData/Local/Temp/infection/phpunitConfiguration.15fec26865a5a5799e20e6cca4baa9f2.infection.xml

..<!DOCTYPE html>
<html>
<head>

[Killed] ReturnRemoval
Controllers/AuthController.php:76:9
         }
 
         //only reached if login failed
-        return 'Invalid email or password.';
+        
     }
 
killedBy: AuthControllerTest::testLoginFailureUnknownUser
statusReason: 1) AuthControllerTest::testLoginFailureUnknownUser
Failed asserting that null matches expected 'Invalid email or password.'.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:41

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Controllers/AuthController.php:81:5
 
 
     //process the registration and return an error string on failure or null on success (since it redirects on success)
-    public function register($email, $password) {
+    protected function register($email, $password)
         [$email, $error] = $this->validateCredentials($email, $password);
         if ($error) return $error;
killedBy: AuthControllerTest::testRegisterInvalidEmailCharacters
statusReason: 1) AuthControllerTest::testRegisterInvalidEmailCharacters
Error: Call to protected method App\Controllers\AuthController::register() from scope AuthControllerTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:47

ERRORS!
Tests: 4, Assertions: 3, Errors: 1.

[Killed] IfNegation
Controllers/AuthController.php:83:9
     //process the registration and return an error string on failure or null on success (since it redirects on success)
     public function register($email, $password) {
         [$email, $error] = $this->validateCredentials($email, $password);
-        if ($error) return $error;
+        if (!$error) {
 
         $user = new User($email, $password);
killedBy: AuthControllerTest::testRegisterInvalidEmailCharacters
statusReason: 1) AuthControllerTest::testRegisterInvalidEmailCharacters
Failed asserting that 'Email already associated with an account.' contains "Email must contain only letters and numbers".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:48

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] ReturnRemoval
Controllers/AuthController.php:83:9
     //process the registration and return an error string on failure or null on success (since it redirects on success)
     public function register($email, $password) {
         [$email, $error] = $this->validateCredentials($email, $password);
-        if ($error) return $error;
+        
 
         $user = new User($email, $password);
statusReason: PHPUnit 10.0.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.12
Configuration: C:/Users/Veronica/AppData/Local/Temp/infection/phpunitConfiguration.dc94305a7625e4b71f0bce020399d4ac.infection.xml

...<!DOCTYPE html>
<html>
<head>

[Killed] IfNegation
Controllers/AuthController.php:87:9
 
         $user = new User($email, $password);
 
-        if ($user->register()) {
-            if (session_status() !== PHP_SESSION_ACTIVE) session_start();
-
-            //new users are buyers by default
-            $_SESSION['user'] = [
-                'accID'       => $user->getId(),
-                'accEmail'    => $user->getEmail(),
-                'accAdmin'    => 0,
-                'accBookings' => [],
-            ];
-
-            //redirect to appropriate page based on admin or not
-            //SUPER IMPRTANT MAKE NEWTICKETMASTERREPOSITORY MATCH YOUR REPO FOLDER NAME (not anymore hopefully)
-            //------------------------------------------------------------
-            $eventController = new EventController();
-            $eventController->showEventsPage($user->isAdmin());
-            exit;
-            //------------------------------------------------------------
-        }
+        if (!$user->register()) {
         //assumption kindof 
         return 'Email already associated with an account.';
statusReason: PHPUnit 10.0.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.12
Configuration: C:/Users/Veronica/AppData/Local/Temp/infection/phpunitConfiguration.a55b75f133410f8906a441247411691f.infection.xml

.....<!DOCTYPE html>
<html>
<head>

[Killed] ReturnRemoval
Controllers/AuthController.php:107:9
             //------------------------------------------------------------
         }
         //assumption kindof 
-        return 'Email already associated with an account.';
+        
     }
 }
killedBy: AuthControllerTest::testRegisterDuplicateEmail
statusReason: 1) AuthControllerTest::testRegisterDuplicateEmail
Failed asserting that null matches expected 'Email already associated with an account.'.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:68

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.
