[Killed] LogicalNot
Controllers/EventController.php:30:9
     private function validateEvent($name, $location, $date, $time, $performer, $tickets)
     {
         //name
-        if (!preg_match('/^[A-Za-z]{8,25}$/', $name)) {
+        if (preg_match('/^[A-Za-z]{8,25}$/', $name)) {
             return "Event name must be 8–25 letters only.";
         }
killedBy: EventControllerTest::testValidateInvalidNamePattern
statusReason: 1) EventControllerTest::testValidateInvalidNamePattern
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 27

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:27

ERRORS!

[Survived] PregMatchRemoveDollar
Controllers/EventController.php:30:9
     private function validateEvent($name, $location, $date, $time, $performer, $tickets)
     {
         //name
-        if (!preg_match('/^[A-Za-z]{8,25}$/', $name)) {
+        if (!preg_match('/^[A-Za-z]{8,25}/', $name)) {
             return "Event name must be 8–25 letters only.";
         }

[Killed] ReturnRemoval
Controllers/EventController.php:31:13
     {
         //name
         if (!preg_match('/^[A-Za-z]{8,25}$/', $name)) {
-            return "Event name must be 8–25 letters only.";
+            
         }
 
killedBy: EventControllerTest::testValidateInvalidNamePattern
statusReason: 1) EventControllerTest::testValidateInvalidNamePattern
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 27

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:27

ERRORS!

[Killed] IfNegation
Controllers/EventController.php:35:9
         }
 
         //unique name
-        if (Event::findByName($name)) {
-            return "Event name already exists.";
-        }
+        if (!Event::findByName($name)) {
 
         //location
killedBy: EventControllerTest::testValidateDuplicateName
statusReason: 1) EventControllerTest::testValidateDuplicateName
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 45

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:45

ERRORS!
Tes

[Killed] ReturnRemoval
Controllers/EventController.php:36:13
 
         //unique name
         if (Event::findByName($name)) {
-            return "Event name already exists.";
+            
         }
 
killedBy: EventControllerTest::testValidateDuplicateName
statusReason: 1) EventControllerTest::testValidateDuplicateName
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 45

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:45

ERRORS!
Tes

[Killed] LogicalNot
Controllers/EventController.php:40:9
         }
 
         //location
-        if (!preg_match('/^[A-Za-z ]{6,30}$/', $location)) {
+        if (preg_match('/^[A-Za-z ]{6,30}$/', $location)) {
             return "Location must be 6–30 letters only.";
         }
killedBy: EventControllerTest::testValidateInvalidLocation
statusReason: 1) EventControllerTest::testValidateInvalidLocation
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 63

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:63

ERRORS!
T

[Survived] PregMatchRemoveDollar
Controllers/EventController.php:40:9
         }
 
         //location
-        if (!preg_match('/^[A-Za-z ]{6,30}$/', $location)) {
+        if (!preg_match('/^[A-Za-z ]{6,30}/', $location)) {
             return "Location must be 6–30 letters only.";
         }

[Killed] ReturnRemoval
Controllers/EventController.php:41:13
 
         //location
         if (!preg_match('/^[A-Za-z ]{6,30}$/', $location)) {
-            return "Location must be 6–30 letters only.";
+            
         }
 
killedBy: EventControllerTest::testValidateInvalidLocation
statusReason: 1) EventControllerTest::testValidateInvalidLocation
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 63

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:63

ERRORS!
T

[Killed] LogicalNot
Controllers/EventController.php:45:9
         }
 
         //date format
-        if (!preg_match('/^\d{2}\/\d{2}\/\d{2}$/', $date)) {
+        if (preg_match('/^\d{2}\/\d{2}\/\d{2}$/', $date)) {
             return "Date must be DD/MM/YY.";
         }
killedBy: EventControllerTest::testValidateDateTooSoon
statusReason: 1) EventControllerTest::testValidateDateTooSoon
Failed asserting that 'Date must be DD/MM/YY.' contains "at least tomorrow".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:76

FAILURES!
Tests: 5, Assertions: 5, Failures: 1.

[Survived] PregMatchRemoveCaret
Controllers/EventController.php:45:9
         }
 
         //date format
-        if (!preg_match('/^\d{2}\/\d{2}\/\d{2}$/', $date)) {
+        if (!preg_match('/\d{2}\/\d{2}\/\d{2}$/', $date)) {
             return "Date must be DD/MM/YY.";
         }

[Survived] ReturnRemoval
Controllers/EventController.php:46:13
 
         //date format
         if (!preg_match('/^\d{2}\/\d{2}\/\d{2}$/', $date)) {
-            return "Date must be DD/MM/YY.";
+            
         }
 

[Killed] LogicalNot
Controllers/EventController.php:51:9
 
         //date >= tomorrow
         $dateObj = DateTime::createFromFormat('d/m/y', $date);
-        if (!$dateObj || $dateObj < new DateTime('+1 day')) {
+        if ($dateObj || $dateObj < new DateTime('+1 day')) {
             return "Date must be at least tomorrow.";
         }
killedBy: EventControllerTest::testValidateInvalidTime
statusReason: 1) EventControllerTest::testValidateInvalidTime
Failed asserting that 'Date must be at least tomorrow.' contains "Time must be".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:82

FAILURES!
Tests: 6, Assertions: 6, Failures: 1.

[Killed] LogicalOr
Controllers/EventController.php:51:9
 
         //date >= tomorrow
         $dateObj = DateTime::createFromFormat('d/m/y', $date);
-        if (!$dateObj || $dateObj < new DateTime('+1 day')) {
+        if (!$dateObj && $dateObj < new DateTime('+1 day')) {
             return "Date must be at least tomorrow.";
         }
killedBy: EventControllerTest::testValidateDateTooSoon
statusReason: 1) EventControllerTest::testValidateDateTooSoon
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 76

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:76

ERRORS!
Tests

[Killed] ReturnRemoval
Controllers/EventController.php:52:13
         //date >= tomorrow
         $dateObj = DateTime::createFromFormat('d/m/y', $date);
         if (!$dateObj || $dateObj < new DateTime('+1 day')) {
-            return "Date must be at least tomorrow.";
+            
         }
 
killedBy: EventControllerTest::testValidateDateTooSoon
statusReason: 1) EventControllerTest::testValidateDateTooSoon
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 76

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:76

ERRORS!
Tests

[Killed] LogicalNot
Controllers/EventController.php:56:9
         }
 
         //time
-        if (!preg_match('/^(2[0-3]|[0-1]?\d):[0-5]\d$/', $time)) {
+        if (preg_match('/^(2[0-3]|[0-1]?\d):[0-5]\d$/', $time)) {
             return "Time must be HH:MM.";
         }
killedBy: EventControllerTest::testValidateInvalidTime
statusReason: 1) EventControllerTest::testValidateInvalidTime
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 82

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:82

ERRORS!
Tests

[Survived] PregMatchRemoveDollar
Controllers/EventController.php:56:9
         }
 
         //time
-        if (!preg_match('/^(2[0-3]|[0-1]?\d):[0-5]\d$/', $time)) {
+        if (!preg_match('/^(2[0-3]|[0-1]?\d):[0-5]\d/', $time)) {
             return "Time must be HH:MM.";
         }

[Killed] ReturnRemoval
Controllers/EventController.php:57:13
 
         //time
         if (!preg_match('/^(2[0-3]|[0-1]?\d):[0-5]\d$/', $time)) {
-            return "Time must be HH:MM.";
+            
         }
 
killedBy: EventControllerTest::testValidateInvalidTime
statusReason: 1) EventControllerTest::testValidateInvalidTime
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 82

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:82

ERRORS!
Tests

[Killed] LogicalNot
Controllers/EventController.php:61:9
         }
 
         //performer name
-        if (!preg_match('/^[A-Za-z ]{4,15}$/', $performer)) {
+        if (preg_match('/^[A-Za-z ]{4,15}$/', $performer)) {
             return "Performer must be 4–15 letters.";
         }
killedBy: EventControllerTest::testValidateInvalidPerformer
statusReason: 1) EventControllerTest::testValidateInvalidPerformer
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 88

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:88

ERRORS!

[Survived] PregMatchRemoveCaret
Controllers/EventController.php:61:9
         }
 
         //performer name
-        if (!preg_match('/^[A-Za-z ]{4,15}$/', $performer)) {
+        if (!preg_match('/[A-Za-z ]{4,15}$/', $performer)) {
             return "Performer must be 4–15 letters.";
         }

[Killed] ReturnRemoval
Controllers/EventController.php:62:13
 
         //performer name
         if (!preg_match('/^[A-Za-z ]{4,15}$/', $performer)) {
-            return "Performer must be 4–15 letters.";
+            
         }
 
killedBy: EventControllerTest::testValidateInvalidPerformer
statusReason: 1) EventControllerTest::testValidateInvalidPerformer
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 88

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:88

ERRORS!

[Killed] LogicalOrNegation
Controllers/EventController.php:66:9
         }
 
         //tickets
-        if ($tickets < 30 || $tickets > 1000) {
+        if (!($tickets < 30 || $tickets > 1000)) {
             return "Tickets must be 30–1000.";
         }
killedBy: EventControllerTest::testValidateInvalidTickets
statusReason: 1) EventControllerTest::testValidateInvalidTickets
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 94

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:94

ERRORS!
Te

[Killed] LogicalOrAllSubExprNegation
Controllers/EventController.php:66:9
         }
 
         //tickets
-        if ($tickets < 30 || $tickets > 1000) {
+        if (!($tickets < 30) || !($tickets > 1000)) {
             return "Tickets must be 30–1000.";
         }
killedBy: EventControllerTest::testValidateValidEvent
statusReason: 1) EventControllerTest::testValidateValidEvent
Failed asserting that 'Tickets must be 30–1000.' is null.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:101

FAILURES!
Tests: 9, Assertions: 9, Failures: 1.

[Killed] ReturnRemoval
Controllers/EventController.php:67:13
 
         //tickets
         if ($tickets < 30 || $tickets > 1000) {
-            return "Tickets must be 30–1000.";
+            
         }
 
killedBy: EventControllerTest::testValidateInvalidTickets
statusReason: 1) EventControllerTest::testValidateInvalidTickets
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 94

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:94

ERRORS!
Te

[Killed] PublicVisibility
Controllers/EventController.php:88:5
     }
 
     //make an event method
-    public function createEvent($name, $location, $date, $time, $performer, $tickets)
+    protected function createEvent($name, $location, $date, $time, $performer, $tickets)
     {
         //validation
killedBy: EventControllerTest::testCreateEventValidationError
statusReason: 1) EventControllerTest::testCreateEventValidationError
Error: Call to protected method App\Controllers\EventController::createEvent() from scope EventControllerTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:107

ERRORS!
Tests: 10, Assertions: 9, Errors: 1.

[Killed] IfNegation
Controllers/EventController.php:92:9
     {
         //validation
         $error = $this->validateEvent($name, $location, $date, $time, $performer, $tickets);
-        if ($error) {
-            return $error;
-        }
+        if (!$error) {
 
         //create model and save
statusReason: PHPUnit 10.0.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.12
Configuration: C:/Users/Veronica/AppData/Local/Temp/infection/phpunitConfiguration.c49bf3587d0af0f2a00c3353e11a48e7.infection.xml

.........

[Killed] ReturnRemoval
Controllers/EventController.php:93:13
         //validation
         $error = $this->validateEvent($name, $location, $date, $time, $performer, $tickets);
         if ($error) {
-            return $error;
+            
         }
 
statusReason: PHPUnit 10.0.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.12
Configuration: C:/Users/Veronica/AppData/Local/Temp/infection/phpunitConfiguration.4873e4a8ee5ad06a9369f5f06b615342.infection.xml

.........
