[Survived] DecrementInteger
Models/Event.php:23:9
         $date = '',
         $time = '',
         $performer = '',
-        $maxTickets = 0,
+        public function __construct($name = '', $location = '', $date = '', $time = '', $performer = '', $maxTickets = -1, $minTickets = 1)
         $minTickets = 1
     ) {

[Survived] IncrementInteger
Models/Event.php:23:9
         $date = '',
         $time = '',
         $performer = '',
-        $maxTickets = 0,
+        public function __construct($name = '', $location = '', $date = '', $time = '', $performer = '', $maxTickets = 1, $minTickets = 1)
         $minTickets = 1
     ) {

[Killed] IncrementInteger
Models/Event.php:24:9
         $time = '',
         $performer = '',
         $maxTickets = 0,
-        $minTickets = 1
+        public function __construct($name = '', $location = '', $date = '', $time = '', $performer = '', $maxTickets = 0, $minTickets = 2)
     ) {
         $this->name = $name;
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Failed asserting that 2 matches expected 1.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:28

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] DecrementInteger
Models/Event.php:24:9
         $time = '',
         $performer = '',
         $maxTickets = 0,
-        $minTickets = 1
+        public function __construct($name = '', $location = '', $date = '', $time = '', $performer = '', $maxTickets = 0, $minTickets = 0)
     ) {
         $this->name = $name;
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Failed asserting that 0 matches expected 1.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:28

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] PublicVisibility
Models/Event.php:36:5
     }
 
     //add event function
-    public function save()
+    protected function save()
     {
         require __DIR__ . '/../config/connect.php';
killedBy: EventTest::testSaveEvent
statusReason: 1) EventTest::testSaveEvent
Error: Call to protected method App\Models\Event::save() from scope EventTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:154

ERRORS!
Tests: 4, Assertions: 13, Errors: 1.

[Killed] Concat
Models/Event.php:38:9
     //add event function
     public function save()
     {
-        require __DIR__ . '/../config/connect.php';
+        require '/../config/connect.php' . __DIR__;
 
         $stmt = $db->prepare("
killedBy: EventTest::testSaveEvent
statusReason: 1) EventTest::testSaveEvent
Error: Failed opening required '/../config/connect.phpC:\xampp\htdocs\projectEngineering\TicketMaster\app\Models' (include_path='C:\xampp\php\PEAR')

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\Event.php:29
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:154

ERRORS!
Tests: 4, Assertions: 13, Errors: 1, Warnings: 1.

[Killed] ConcatOperandRemoval
Models/Event.php:38:9
     //add event function
     public function save()
     {
-        require __DIR__ . '/../config/connect.php';
+        require '/../config/connect.php';
 
         $stmt = $db->prepare("
killedBy: EventTest::testSaveEvent
statusReason: 1) EventTest::testSaveEvent
Error: Failed opening required '/../config/connect.php' (include_path='C:\xampp\php\PEAR')

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\Event.php:29
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:154

ERRORS!
Tests: 4, Assertions: 13, Errors: 1, Warnings: 1.

[Killed] ReturnRemoval
Models/Event.php:46:9
             VALUES (?, ?, ?, ?, ?, ?, ?)
         ");
 
-        return $stmt->execute([
-            $this->name,
-            $this->location,
-            $this->date,
-            $this->time,
-            $this->performer,
-            $this->maxTickets,
-            $this->minTickets
-        ]);
+        
     }
 
killedBy: EventTest::testSaveEvent
statusReason: 1) EventTest::testSaveEvent
Failed asserting that null is true.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:156

FAILURES!
Tests: 4, Assertions: 14, Failures: 1.

[Killed] ArrayItemRemoval
Models/Event.php:46:9
             VALUES (?, ?, ?, ?, ?, ?, ?)
         ");
 
-        return $stmt->execute([
-            $this->name,
-            $this->location,
-            $this->date,
-            $this->time,
-            $this->performer,
-            $this->maxTickets,
-            $this->minTickets
-        ]);
+        return $stmt->execute([$this->location, $this->date, $this->time, $this->performer, $this->maxTickets, $this->minTickets]);
     }
 
killedBy: EventTest::testSaveEvent
statusReason: 1) EventTest::testSaveEvent
PDOException: SQLSTATE[HY093]: Invalid parameter number: number of bound variables does not match number of tokens

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\Event.php:31
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:154

ERRORS!
Tests: 4, Assertions: 13, Errors: 1.

[Killed] PublicVisibility
Models/Event.php:58:5
     }
 
     //gett all events, if admin show all, if user show future only
-    public static function all($isAdmin)
+    protected static function all($isAdmin)
     {
         require __DIR__ . '/../config/connect.php';
killedBy: EventTest::testGetAllEventsForUser
statusReason: 1) EventTest::testGetAllEventsForUser
Error: Call to protected method App\Models\Event::all() from scope EventTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:73

ERRORS!
Tests: 2, Assertions: 7, Errors: 1.

[Killed] ConcatOperandRemoval
Models/Event.php:60:9
     //gett all events, if admin show all, if user show future only
     public static function all($isAdmin)
     {
-        require __DIR__ . '/../config/connect.php';
+        require __DIR__;
 
         if ($isAdmin) {
killedBy: EventTest::testGetAllEventsForUser
statusReason: 1) EventTest::testGetAllEventsForUser
Error: Failed opening required 'C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models' (include_path='C:\xampp\php\PEAR')

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\Event.php:36
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:73

ERRORS!
Tests: 2, Assertions: 7, Errors: 1, Warnings: 1.

[Killed] IfNegation
Models/Event.php:62:9
     {
         require __DIR__ . '/../config/connect.php';
 
-        if ($isAdmin) {
-            $sql = "SELECT * FROM events ORDER BY STR_TO_DATE(eventDate, '%d-%m-%Y')";
-        } else {
-            $sql = "SELECT * FROM events 
-                    WHERE STR_TO_DATE(eventDate, '%d-%m-%Y') >= CURDATE()
-                    ORDER BY STR_TO_DATE(eventDate, '%d-%m-%Y')";
-        }
+        if (!$isAdmin) {
 
         $stmt = $db->query($sql);
killedBy: EventTest::testGetAllEventsForUser
statusReason: 1) EventTest::testGetAllEventsForUser
Failed asserting that 9 matches expected 2.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:75

FAILURES!
Tests: 2, Assertions: 9, Failures: 1.

[Killed] ReturnRemoval
Models/Event.php:71:9
         }
 
         $stmt = $db->query($sql);
-        return $stmt->fetchAll(PDO::FETCH_ASSOC);
+        
     }
 
killedBy: EventTest::testGetAllEventsForUser
statusReason: 1) EventTest::testGetAllEventsForUser
Failed asserting that null is of type "array".

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:74

FAILURES!
Tests: 2, Assertions: 8, Failures: 1.

[Killed] PublicVisibility
Models/Event.php:100:5
     }
 
     //find by name function
-    public static function findByName($name)
+    protected static function findByName($name)
     {
         require __DIR__ . '/../config/connect.php';
killedBy: EventControllerTest::testValidateDuplicateName
statusReason: 1) EventControllerTest::testValidateDuplicateName
Error: Call to protected method App\Models\Event::findByName() from scope App\Controllers\EventController

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Controllers\EventController.php:35
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:21
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Cont

[Killed] MethodCallRemoval
Models/Event.php:105:9
         require __DIR__ . '/../config/connect.php';
 
         $stmt = $db->prepare("SELECT * FROM events WHERE eventName = ?");
-        $stmt->execute([$name]);
+        
         return $stmt->fetch(PDO::FETCH_ASSOC);
     }
killedBy: EventControllerTest::testValidateDuplicateName
statusReason: 1) EventControllerTest::testValidateDuplicateName
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 45

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:45

ERRORS!
Tes

[Killed] ReturnRemoval
Models/Event.php:106:9
 
         $stmt = $db->prepare("SELECT * FROM events WHERE eventName = ?");
         $stmt->execute([$name]);
-        return $stmt->fetch(PDO::FETCH_ASSOC);
+        
     }
 
killedBy: EventControllerTest::testValidateDuplicateName
statusReason: 1) EventControllerTest::testValidateDuplicateName
TypeError: PHPUnit\Framework\Assert::assertStringContainsString(): Argument #2 ($haystack) must be of type string, null given, called in C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php on line 45

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\EventControllerTest.php:45

ERRORS!
Tes

[Killed] PublicVisibility
Models/Event.php:110:5
     }
 
     //delete function
-    public static function delete($id)
+    protected static function delete($id)
     {
         require __DIR__ . '/../config/connect.php';
killedBy: EventTest::testGetAllEventsForUser
statusReason: 1) EventTest::testGetAllEventsForUser
Failed asserting that 9 matches expected 2.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:75

FAILURES!
Tests: 2, Assertions: 9, Failures: 1.

[Killed] ReturnRemoval
Models/Event.php:115:9
         require __DIR__ . '/../config/connect.php';
 
         $stmt = $db->prepare("DELETE FROM events WHERE eventID = ?");
-        return $stmt->execute([$id]);
+        
     }
 
killedBy: EventTest::testGetAllEventsForUser
statusReason: 1) EventTest::testGetAllEventsForUser
Failed asserting that 9 matches expected 2.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:75

FAILURES!
Tests: 2, Assertions: 9, Failures: 1.

[Killed] PublicVisibility
Models/Event.php:124:5
         return $this->id;
     }
 
-    public function getName()
+    protected function getName()
     {
         return $this->name;
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Error: Call to protected method App\Models\Event::getName() from scope EventTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:22

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ReturnRemoval
Models/Event.php:126:9
 
     public function getName()
     {
-        return $this->name;
+        
     }
 
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Failed asserting that null matches expected 'Concert Night'.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:22

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Models/Event.php:129:5
         return $this->name;
     }
 
-    public function getLocation()
+    protected function getLocation()
     {
         return $this->location;
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Error: Call to protected method App\Models\Event::getLocation() from scope EventTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:23

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] ReturnRemoval
Models/Event.php:131:9
 
     public function getLocation()
     {
-        return $this->location;
+        
     }
 
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Failed asserting that null matches expected 'Dublin Hall'.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:23

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Models/Event.php:134:5
         return $this->location;
     }
 
-    public function getDate()
+    protected function getDate()
     {
         return $this->date;
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Error: Call to protected method App\Models\Event::getDate() from scope EventTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:24

ERRORS!
Tests: 1, Assertions: 2, Errors: 1.

[Killed] ReturnRemoval
Models/Event.php:136:9
 
     public function getDate()
     {
-        return $this->date;
+        
     }
 
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Failed asserting that null matches expected '15/12/25'.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:24

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Models/Event.php:139:5
         return $this->date;
     }
 
-    public function getTime()
+    protected function getTime()
     {
         return $this->time;
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Error: Call to protected method App\Models\Event::getTime() from scope EventTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:25

ERRORS!
Tests: 1, Assertions: 3, Errors: 1.

[Killed] ReturnRemoval
Models/Event.php:141:9
 
     public function getTime()
     {
-        return $this->time;
+        
     }
 
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Failed asserting that null matches expected '19:30'.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:25

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
Models/Event.php:144:5
         return $this->time;
     }
 
-    public function getPerformer()
+    protected function getPerformer()
     {
         return $this->performer;
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Error: Call to protected method App\Models\Event::getPerformer() from scope EventTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:26

ERRORS!
Tests: 1, Assertions: 4, Errors: 1.

[Killed] ReturnRemoval
Models/Event.php:146:9
 
     public function getPerformer()
     {
-        return $this->performer;
+        
     }
 
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Failed asserting that null matches expected 'The Band'.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:26

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] PublicVisibility
Models/Event.php:149:5
         return $this->performer;
     }
 
-    public function getMaxTickets()
+    protected function getMaxTickets()
     {
         return $this->maxTickets;
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Error: Call to protected method App\Models\Event::getMaxTickets() from scope EventTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:27

ERRORS!
Tests: 1, Assertions: 5, Errors: 1.

[Killed] ReturnRemoval
Models/Event.php:151:9
 
     public function getMaxTickets()
     {
-        return $this->maxTickets;
+        
     }
 
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Failed asserting that null matches expected 100.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:27

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] PublicVisibility
Models/Event.php:154:5
         return $this->maxTickets;
     }
 
-    public function getMinTickets()
+    protected function getMinTickets()
     {
         return $this->minTickets;
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Error: Call to protected method App\Models\Event::getMinTickets() from scope EventTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:28

ERRORS!
Tests: 1, Assertions: 6, Errors: 1.

[Killed] ReturnRemoval
Models/Event.php:156:9
 
     public function getMinTickets()
     {
-        return $this->minTickets;
+        
     }
 }
killedBy: EventTest::testCreateEvent
statusReason: 1) EventTest::testCreateEvent
Failed asserting that null matches expected 1.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\EventTest.php:28

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.
