[Killed] ReturnRemoval
Models/User.php:21:5
     }
 
     //making the getters and setters of the class
-    public function getId() { return $this->id; }
+    
     public function getEmail() { return $this->email; }
     public function getPassword() { return $this->password; }
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
Failed asserting that null matches expected 1.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:46

FAILURES!
Tests: 2, Assertions: 6, Failures: 1.

[Killed] PublicVisibility
Models/User.php:21:5
     }
 
     //making the getters and setters of the class
-    public function getId() { return $this->id; }
+    protected function getId()
     public function getEmail() { return $this->email; }
     public function getPassword() { return $this->password; }
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
Error: Call to protected method App\Models\User::getId() from scope UserTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:46

ERRORS!
Tests: 2, Assertions: 5, Errors: 1.

[Killed] ReturnRemoval
Models/User.php:22:5
 
     //making the getters and setters of the class
     public function getId() { return $this->id; }
-    public function getEmail() { return $this->email; }
+    
     public function getPassword() { return $this->password; }
     public function isAdmin() { return (bool)$this->isAdmin; }
killedBy: UserTest::testCreateUser
statusReason: 1) UserTest::testCreateUser
Failed asserting that null matches expected 'test@example.com'.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:22

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Models/User.php:22:5
 
     //making the getters and setters of the class
     public function getId() { return $this->id; }
-    public function getEmail() { return $this->email; }
+    protected function getEmail()
     public function getPassword() { return $this->password; }
     public function isAdmin() { return (bool)$this->isAdmin; }
killedBy: UserTest::testCreateUser
statusReason: 1) UserTest::testCreateUser
Error: Call to protected method App\Models\User::getEmail() from scope UserTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:22

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Models/User.php:23:5
     //making the getters and setters of the class
     public function getId() { return $this->id; }
     public function getEmail() { return $this->email; }
-    public function getPassword() { return $this->password; }
+    protected function getPassword()
     public function isAdmin() { return (bool)$this->isAdmin; }
     public function getBookings() { return $this->bookings; }
killedBy: UserTest::testCreateUser
statusReason: 1) UserTest::testCreateUser
Error: Call to protected method App\Models\User::getPassword() from scope UserTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:23

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] ReturnRemoval
Models/User.php:23:5
     //making the getters and setters of the class
     public function getId() { return $this->id; }
     public function getEmail() { return $this->email; }
-    public function getPassword() { return $this->password; }
+    
     public function isAdmin() { return (bool)$this->isAdmin; }
     public function getBookings() { return $this->bookings; }
killedBy: UserTest::testCreateUser
statusReason: 1) UserTest::testCreateUser
Failed asserting that null matches expected 'password123'.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:23

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Models/User.php:24:5
     public function getId() { return $this->id; }
     public function getEmail() { return $this->email; }
     public function getPassword() { return $this->password; }
-    public function isAdmin() { return (bool)$this->isAdmin; }
+    protected function isAdmin()
     public function getBookings() { return $this->bookings; }
 
killedBy: UserTest::testCreateUser
statusReason: 1) UserTest::testCreateUser
Error: Call to protected method App\Models\User::isAdmin() from scope UserTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:24

ERRORS!
Tests: 1, Assertions: 2, Errors: 1.

[Killed] ReturnRemoval
Models/User.php:24:5
     public function getId() { return $this->id; }
     public function getEmail() { return $this->email; }
     public function getPassword() { return $this->password; }
-    public function isAdmin() { return (bool)$this->isAdmin; }
+    
     public function getBookings() { return $this->bookings; }
 
killedBy: UserTest::testCreateUser
statusReason: 1) UserTest::testCreateUser
Failed asserting that null is false.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:24

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Models/User.php:25:5
     public function getEmail() { return $this->email; }
     public function getPassword() { return $this->password; }
     public function isAdmin() { return (bool)$this->isAdmin; }
-    public function getBookings() { return $this->bookings; }
+    protected function getBookings()
 
     public function setEmail($email) { $this->email = $email; }
killedBy: UserTest::testCreateUser
statusReason: 1) UserTest::testCreateUser
Error: Call to protected method App\Models\User::getBookings() from scope UserTest

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:25

ERRORS!
Tests: 1, Assertions: 3, Errors: 1.

[Survived] ReturnRemoval
Models/User.php:25:5
     public function getEmail() { return $this->email; }
     public function getPassword() { return $this->password; }
     public function isAdmin() { return (bool)$this->isAdmin; }
-    public function getBookings() { return $this->bookings; }
+    
 
     public function setEmail($email) { $this->email = $email; }

[Killed] PublicVisibility
Models/User.php:31:5
     public function setPassword($password) { $this->password = $password; }
 
     //attempt login from the DB which returns true on success
-    public function login() {
+    protected function login()
         require __DIR__ . '/../config/connect.php';
 
killedBy: AuthControllerTest::testLoginFailureUnknownUser
statusReason: 1) AuthControllerTest::testLoginFailureUnknownUser
Error: Call to protected method App\Models\User::login() from scope App\Controllers\AuthController

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Controllers\AuthController.php:54
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:40

ERRORS!
Tests: 3, Assertions: 2, Errors: 1.

[Killed] ConcatOperandRemoval
Models/User.php:32:9
 
     //attempt login from the DB which returns true on success
     public function login() {
-        require __DIR__ . '/../config/connect.php';
+        require '/../config/connect.php';
 
         $stmt = $db->prepare("SELECT * FROM accounts WHERE accEmail = ?");
killedBy: AuthControllerTest::testLoginFailureUnknownUser
statusReason: 1) AuthControllerTest::testLoginFailureUnknownUser
Error: Failed opening required '/../config/connect.php' (include_path='C:\xampp\php\PEAR')

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\User.php:52
C:\xampp\htdocs\projectEngineering\TicketMaster\app\Controllers\AuthController.php:54
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:40

[Killed] Concat
Models/User.php:32:9
 
     //attempt login from the DB which returns true on success
     public function login() {
-        require __DIR__ . '/../config/connect.php';
+        require '/../config/connect.php' . __DIR__;
 
         $stmt = $db->prepare("SELECT * FROM accounts WHERE accEmail = ?");
killedBy: AuthControllerTest::testLoginFailureUnknownUser
statusReason: 1) AuthControllerTest::testLoginFailureUnknownUser
Error: Failed opening required '/../config/connect.phpC:\xampp\htdocs\projectEngineering\TicketMaster\app\Models' (include_path='C:\xampp\php\PEAR')

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\User.php:52
C:\xampp\htdocs\projectEngineering\TicketMaster\app\Controllers\AuthController.php:54
C:\xampp\htdocs\projectEngineering\Ti

[Killed] MethodCallRemoval
Models/User.php:35:9
         require __DIR__ . '/../config/connect.php';
 
         $stmt = $db->prepare("SELECT * FROM accounts WHERE accEmail = ?");
-        $stmt->execute([$this->email]);
+        
         $row = $stmt->fetch(PDO::FETCH_ASSOC);
 
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
Failed asserting that false is true.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:45

FAILURES!
Tests: 8, Assertions: 11, Failures: 1.

[Killed] LogicalAnd
Models/User.php:39:9
         $row = $stmt->fetch(PDO::FETCH_ASSOC);
 
         //verify if password is right and pass in the variables (from the DB) into the user if it works
-        if ($row && $row['accPassword'] === $this->password) {
+        if ($row || $row['accPassword'] === $this->password) {
             $this->id = $row['accID'];
             $this->isAdmin = $row['accAdmin'];
statusReason: PHPUnit 10.0.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.12
Configuration: C:/Users/Veronica/AppData/Local/Temp/infection/phpunitConfiguration.4ba5252f9ac348164b3927246c4523ff.infection.xml

..W
Notice: fwrite(): Write of 201 bytes failed with errno=13 Permission denied in C:\xampp\htdocs\projectEngineering\TicketMaster\vendor\infection\include-interceptor\src\IncludeIn

[Killed] Identical
Models/User.php:39:9
         $row = $stmt->fetch(PDO::FETCH_ASSOC);
 
         //verify if password is right and pass in the variables (from the DB) into the user if it works
-        if ($row && $row['accPassword'] === $this->password) {
+        if ($row && $row['accPassword'] !== $this->password) {
             $this->id = $row['accID'];
             $this->isAdmin = $row['accAdmin'];
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
Failed asserting that false is true.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:45

FAILURES!
Tests: 8, Assertions: 11, Failures: 1.

[Survived] MethodCallRemoval
Models/User.php:44:13
             $this->isAdmin = $row['accAdmin'];
             // Load bookings from eventDetails table
             $b = $db->prepare("SELECT eventID FROM eventDetails WHERE accID = ?");
-            $b->execute([$this->id]);
+            
             $this->bookings = $b->fetchAll(PDO::FETCH_COLUMN);
             return true;

[Killed] TrueValue
Models/User.php:46:13
             $b = $db->prepare("SELECT eventID FROM eventDetails WHERE accID = ?");
             $b->execute([$this->id]);
             $this->bookings = $b->fetchAll(PDO::FETCH_COLUMN);
-            return true;
+            return false;
         }
         return false;
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
Failed asserting that false is true.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:45

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Killed] ReturnRemoval
Models/User.php:46:13
             $b = $db->prepare("SELECT eventID FROM eventDetails WHERE accID = ?");
             $b->execute([$this->id]);
             $this->bookings = $b->fetchAll(PDO::FETCH_COLUMN);
-            return true;
+            
         }
         return false;
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
Failed asserting that false is true.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:45

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Killed] ReturnRemoval
Models/User.php:48:9
             $this->bookings = $b->fetchAll(PDO::FETCH_COLUMN);
             return true;
         }
-        return false;
+        
     }
 
killedBy: UserTest::testLoginFailsForWrongPassword
statusReason: 1) UserTest::testLoginFailsForWrongPassword
Failed asserting that null is false.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:59

FAILURES!
Tests: 9, Assertions: 14, Failures: 1.

[Killed] PublicVisibility
Models/User.php:52:5
     }
 
     //create a new account and return the created User object or false
-    public function register() {
+    protected function register()
         require __DIR__ . '/../config/connect.php';
 
killedBy: AuthControllerTest::testRegisterDuplicateEmail
statusReason: 1) AuthControllerTest::testRegisterDuplicateEmail
Error: Call to protected method App\Models\User::register() from scope App\Controllers\AuthController

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Controllers\AuthController.php:87
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Controllers\AuthControllerTest.php:67

ERRORS!
Tests: 6, Assertions: 5, Errors: 1.

[Killed] ConcatOperandRemoval
Models/User.php:53:9
 
     //create a new account and return the created User object or false
     public function register() {
-        require __DIR__ . '/../config/connect.php';
+        require __DIR__;
 
         //the check for if the email already exists and if it does return false
killedBy: AuthControllerTest::testRegisterDuplicateEmail
statusReason: 1) AuthControllerTest::testRegisterDuplicateEmail
Error: Failed opening required 'C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models' (include_path='C:\xampp\php\PEAR')

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\User.php:71
C:\xampp\htdocs\projectEngineering\TicketMaster\app\Controllers\AuthController.php:87
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\Contro

[Killed] Concat
Models/User.php:53:9
 
     //create a new account and return the created User object or false
     public function register() {
-        require __DIR__ . '/../config/connect.php';
+        require '/../config/connect.php' . __DIR__;
 
         //the check for if the email already exists and if it does return false
killedBy: AuthControllerTest::testRegisterDuplicateEmail
statusReason: 1) AuthControllerTest::testRegisterDuplicateEmail
Error: Failed opening required '/../config/connect.phpC:\xampp\htdocs\projectEngineering\TicketMaster\app\Models' (include_path='C:\xampp\php\PEAR')

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\User.php:71
C:\xampp\htdocs\projectEngineering\TicketMaster\app\Controllers\AuthController.php:87
C:\xampp\htdocs\projectEngineering\Tic

[Killed] MethodCallRemoval
Models/User.php:57:9
 
         //the check for if the email already exists and if it does return false
         $check = $db->prepare("SELECT accID FROM accounts WHERE accEmail = ?");
-        $check->execute([$this->email]);
+        
         if ($check->rowCount() > 0) return false;
 
statusReason: PHPUnit 10.0.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.12
Configuration: C:/Users/Veronica/AppData/Local/Temp/infection/phpunitConfiguration.5464f464ca6d529f1ba6f40efa9ccff8.infection.xml

.....<!DOCTYPE html>
<html>
<head>

[Killed] ArrayItemRemoval
Models/User.php:57:9
 
         //the check for if the email already exists and if it does return false
         $check = $db->prepare("SELECT accID FROM accounts WHERE accEmail = ?");
-        $check->execute([$this->email]);
+        $check->execute([]);
         if ($check->rowCount() > 0) return false;
 
killedBy: AuthControllerTest::testRegisterDuplicateEmail
statusReason: 1) AuthControllerTest::testRegisterDuplicateEmail
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near '?' at line 1

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\User.php:74
C:\xampp\htdocs\projectEngineering\TicketMaster\app\Co

[Killed] GreaterThanNegotiation
Models/User.php:58:9
         //the check for if the email already exists and if it does return false
         $check = $db->prepare("SELECT accID FROM accounts WHERE accEmail = ?");
         $check->execute([$this->email]);
-        if ($check->rowCount() > 0) return false;
+        if ($check->rowCount() <= 0) {
 
         //insert the new user into the DB with their details if it passes the check
statusReason: PHPUnit 10.0.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.12
Configuration: C:/Users/Veronica/AppData/Local/Temp/infection/phpunitConfiguration.d310eb7722a8485a2bf0fe84deea7323.infection.xml

.....<!DOCTYPE html>
<html>
<head>

[Killed] ReturnRemoval
Models/User.php:58:9
         //the check for if the email already exists and if it does return false
         $check = $db->prepare("SELECT accID FROM accounts WHERE accEmail = ?");
         $check->execute([$this->email]);
-        if ($check->rowCount() > 0) return false;
+        
 
         //insert the new user into the DB with their details if it passes the check
statusReason: PHPUnit 10.0.0 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.12
Configuration: C:/Users/Veronica/AppData/Local/Temp/infection/phpunitConfiguration.70334eb05d7c67cc3f398f5ba0c9794f.infection.xml

.....<!DOCTYPE html>
<html>
<head>

[Killed] IfNegation
Models/User.php:62:9
 
         //insert the new user into the DB with their details if it passes the check
         $insert = $db->prepare("INSERT INTO accounts (accEmail, accPassword, accAdmin) VALUES (?, ?, 0)");
-        if ($insert->execute([$this->email, $this->password])) {
-            $this->id = $db->lastInsertId();
-            $this->bookings = [];
-            return true;
-        }
+        if (!$insert->execute([$this->email, $this->password])) {
         return false;
     }
killedBy: UserTest::testRegisterSucceedsForNewEmail
statusReason: 1) UserTest::testRegisterSucceedsForNewEmail
Registration should succeed for a unique email
Failed asserting that false is true.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:90

FAILURES!
Tests: 5, Assertions: 10, Failures: 1.

[Killed] ReturnRemoval
Models/User.php:65:13
         if ($insert->execute([$this->email, $this->password])) {
             $this->id = $db->lastInsertId();
             $this->bookings = [];
-            return true;
+            
         }
         return false;
killedBy: UserTest::testRegisterSucceedsForNewEmail
statusReason: 1) UserTest::testRegisterSucceedsForNewEmail
Registration should succeed for a unique email
Failed asserting that false is true.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:90

FAILURES!
Tests: 5, Assertions: 10, Failures: 1.

[Killed] TrueValue
Models/User.php:65:13
         if ($insert->execute([$this->email, $this->password])) {
             $this->id = $db->lastInsertId();
             $this->bookings = [];
-            return true;
+            return false;
         }
         return false;
killedBy: UserTest::testRegisterSucceedsForNewEmail
statusReason: 1) UserTest::testRegisterSucceedsForNewEmail
Registration should succeed for a unique email
Failed asserting that false is true.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:90

FAILURES!
Tests: 5, Assertions: 10, Failures: 1.
