[Killed] CastBool
User.php:24:5
     public function getId() { return $this->id; }
     public function getEmail() { return $this->email; }
     public function getPassword() { return $this->password; }
-    public function isAdmin() { return (bool)$this->isAdmin; }
+    return $this->isAdmin;
     public function getBookings() { return $this->bookings; }
 
killedBy: UserTest::testCreateUser
statusReason: 1) UserTest::testCreateUser
Failed asserting that 0 is false.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:24

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
User.php:32:9
 
     //attempt login from the DB which returns true on success
     public function login() {
-        require __DIR__ . '/../config/connect.php';
+        require __DIR__;
 
         $stmt = $db->prepare("SELECT * FROM accounts WHERE accEmail = ?");
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
Error: Failed opening required 'C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models' (include_path='C:\xampp\php\PEAR')

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\User.php:52
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:45

ERRORS!
Tests: 2, Assertions: 4, Errors: 1, Warnings: 1.

[Killed] ArrayItemRemoval
User.php:35:9
         require __DIR__ . '/../config/connect.php';
 
         $stmt = $db->prepare("SELECT * FROM accounts WHERE accEmail = ?");
-        $stmt->execute([$this->email]);
+        $stmt->execute([]);
         $row = $stmt->fetch(PDO::FETCH_ASSOC);
 
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near '?' at line 1

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\User.php:54
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:45

E

[Killed] LogicalAndSingleSubExprNegation
User.php:39:9
         $row = $stmt->fetch(PDO::FETCH_ASSOC);
 
         //verify if password is right and pass in the variables (from the DB) into the user if it works
-        if ($row && $row['accPassword'] === $this->password) {
+        if (!$row && $row['accPassword'] === $this->password) {
             $this->id = $row['accID'];
             $this->isAdmin = $row['accAdmin'];
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
Failed asserting that false is true.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:45

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Killed] LogicalAndAllSubExprNegation
User.php:39:9
         $row = $stmt->fetch(PDO::FETCH_ASSOC);
 
         //verify if password is right and pass in the variables (from the DB) into the user if it works
-        if ($row && $row['accPassword'] === $this->password) {
+        if (!$row && !($row['accPassword'] === $this->password)) {
             $this->id = $row['accID'];
             $this->isAdmin = $row['accAdmin'];
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
Failed asserting that false is true.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:45

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Killed] ArrayItemRemoval
User.php:44:13
             $this->isAdmin = $row['accAdmin'];
             // Load bookings from eventDetails table
             $b = $db->prepare("SELECT eventID FROM eventDetails WHERE accID = ?");
-            $b->execute([$this->id]);
+            $b->execute([]);
             $this->bookings = $b->fetchAll(PDO::FETCH_COLUMN);
             return true;
killedBy: UserTest::testLoginSuccess
statusReason: 1) UserTest::testLoginSuccess
PDOException: SQLSTATE[42000]: Syntax error or access violation: 1064 You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near '?' at line 1

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\User.php:62
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:45

E

[Killed] ConcatOperandRemoval
User.php:53:9
 
     //create a new account and return the created User object or false
     public function register() {
-        require __DIR__ . '/../config/connect.php';
+        require '/../config/connect.php';
 
         //the check for if the email already exists and if it does return false
killedBy: UserTest::testDuplicateEmail
statusReason: 1) UserTest::testDuplicateEmail
Error: Failed opening required '/../config/connect.php' (include_path='C:\xampp\php\PEAR')

C:\xampp\htdocs\projectEngineering\TicketMaster\app\Models\User.php:71
C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:69

ERRORS!
Tests: 4, Assertions: 8, Errors: 1, Warnings: 1.

[Killed] FalseValue
User.php:58:9
         //the check for if the email already exists and if it does return false
         $check = $db->prepare("SELECT accID FROM accounts WHERE accEmail = ?");
         $check->execute([$this->email]);
-        if ($check->rowCount() > 0) return false;
+        return true;
 
         //insert the new user into the DB with their details if it passes the check
killedBy: UserTest::testDuplicateEmail
statusReason: 1) UserTest::testDuplicateEmail
Failed asserting that true is false.

C:\xampp\htdocs\projectEngineering\TicketMaster\tests\UserTest.php:69

FAILURES!
Tests: 4, Assertions: 9, Failures: 1.
